; domain
(define (domain zeno-travel)
(:requirements :typing :fluents)
(:types aircraft person city - object)
(:predicates (at ?x - (either person aircraft) ?c - city)
             (in ?p - person ?a - aircraft))
(:functions (fuel ?a - aircraft)
            (distance ?c1 - city ?c2 - city)
            (slow-burn ?a - aircraft)
            (fast-burn ?a - aircraft)
            (capacity ?a - aircraft)
            (total-fuel-used)
	    (onboard ?a - aircraft)
            (zoom-limit ?a - aircraft)
            )


(:action board
 :parameters (?p - person ?a - aircraft ?c - city)
 :precondition (and (at ?p ?c)
                 (at ?a ?c))
 :effect (and (not (at ?p ?c))
              (in ?p ?a)
		(increase (onboard ?a) 1)))


(:action debark
 :parameters (?p - person ?a - aircraft ?c - city)
 :precondition (and (in ?p ?a)
                 (at ?a ?c))
 :effect (and (not (in ?p ?a))
              (at ?p ?c)
		(decrease (onboard ?a) 1)))

(:action fly 
 :parameters (?a - aircraft ?c1 ?c2 - city)
 :precondition (and (at ?a ?c1)
                 (>= (fuel ?a) 
                         (* (distance ?c1 ?c2) (slow-burn ?a))))
 :effect (and (not (at ?a ?c1))
              (at ?a ?c2)
              (increase (total-fuel-used)
                         (* (distance ?c1 ?c2) (slow-burn ?a)))
              (decrease (fuel ?a) 
                         (* (distance ?c1 ?c2) (slow-burn ?a)))))
                                  
(:action zoom
 :parameters (?a - aircraft ?c1 ?c2 - city)
 :precondition (and (at ?a ?c1)
                 (>= (fuel ?a) 
                         (* (distance ?c1 ?c2) (fast-burn ?a)))
                 (<= (onboard ?a) (zoom-limit ?a)))
 :effect (and (not (at ?a ?c1))
              (at ?a ?c2)
              (increase (total-fuel-used)
                         (* (distance ?c1 ?c2) (fast-burn ?a)))
              (decrease (fuel ?a) 
                         (* (distance ?c1 ?c2) (fast-burn ?a)))
	)
) 

(:action refuel	
 :parameters (?a - aircraft ?c - city)
 :precondition (and (> (capacity ?a) (fuel ?a))
               (at ?a ?c)
		)
 :effect (and (assign (fuel ?a) (capacity ?a)))
)


)

; problem
(define (problem ZTRAVEL-2-8)
(:domain zeno-travel)
(:objects
	plane1 - aircraft
	plane2 - aircraft
	person1 - person
	person2 - person
	person3 - person
	person4 - person
	person5 - person
	person6 - person
	person7 - person
	person8 - person
	city0 - city
	city1 - city
	city2 - city
	city3 - city
	city4 - city
	city5 - city
	city6 - city
	city7 - city
	)
(:init
	(at plane1 city0)
	(= (capacity plane1) 2874)
	(= (fuel plane1) 940)
	(= (slow-burn plane1) 1)
	(= (fast-burn plane1) 3)
	(= (onboard plane1) 0)
	(= (zoom-limit plane1) 8)
	(at plane2 city7)
	(= (capacity plane2) 7274)
	(= (fuel plane2) 1659)
	(= (slow-burn plane2) 3)
	(= (fast-burn plane2) 10)
	(= (onboard plane2) 0)
	(= (zoom-limit plane2) 7)
	(at person1 city4)
	(at person2 city7)
	(at person3 city1)
	(at person4 city1)
	(at person5 city6)
	(at person6 city4)
	(at person7 city1)
	(at person8 city0)
	(= (distance city0 city0) 0)
	(= (distance city0 city1) 743)
	(= (distance city0 city2) 933)
	(= (distance city0 city3) 796)
	(= (distance city0 city4) 607)
	(= (distance city0 city5) 505)
	(= (distance city0 city6) 757)
	(= (distance city0 city7) 997)
	(= (distance city1 city0) 743)
	(= (distance city1 city1) 0)
	(= (distance city1 city2) 515)
	(= (distance city1 city3) 800)
	(= (distance city1 city4) 527)
	(= (distance city1 city5) 763)
	(= (distance city1 city6) 544)
	(= (distance city1 city7) 882)
	(= (distance city2 city0) 933)
	(= (distance city2 city1) 515)
	(= (distance city2 city2) 0)
	(= (distance city2 city3) 907)
	(= (distance city2 city4) 944)
	(= (distance city2 city5) 581)
	(= (distance city2 city6) 607)
	(= (distance city2 city7) 893)
	(= (distance city3 city0) 796)
	(= (distance city3 city1) 800)
	(= (distance city3 city2) 907)
	(= (distance city3 city3) 0)
	(= (distance city3 city4) 894)
	(= (distance city3 city5) 533)
	(= (distance city3 city6) 716)
	(= (distance city3 city7) 526)
	(= (distance city4 city0) 607)
	(= (distance city4 city1) 527)
	(= (distance city4 city2) 944)
	(= (distance city4 city3) 894)
	(= (distance city4 city4) 0)
	(= (distance city4 city5) 670)
	(= (distance city4 city6) 754)
	(= (distance city4 city7) 508)
	(= (distance city5 city0) 505)
	(= (distance city5 city1) 763)
	(= (distance city5 city2) 581)
	(= (distance city5 city3) 533)
	(= (distance city5 city4) 670)
	(= (distance city5 city5) 0)
	(= (distance city5 city6) 630)
	(= (distance city5 city7) 681)
	(= (distance city6 city0) 757)
	(= (distance city6 city1) 544)
	(= (distance city6 city2) 607)
	(= (distance city6 city3) 716)
	(= (distance city6 city4) 754)
	(= (distance city6 city5) 630)
	(= (distance city6 city6) 0)
	(= (distance city6 city7) 879)
	(= (distance city7 city0) 997)
	(= (distance city7 city1) 882)
	(= (distance city7 city2) 893)
	(= (distance city7 city3) 526)
	(= (distance city7 city4) 508)
	(= (distance city7 city5) 681)
	(= (distance city7 city6) 879)
	(= (distance city7 city7) 0)
	(= (total-fuel-used) 0)
)
(:goal (and
	(at plane1 city0)
	(at person1 city0)
	(at person2 city4)
	(at person3 city7)
	(at person4 city0)
	(at person5 city7)
	(at person6 city7)
	(at person7 city7)
	(at person8 city3)
	))

(:metric minimize (+ (* 4 (total-time))  (* 3 (total-fuel-used))))
)

; plan
1. (board person8 plane1 city0)
   deleted: (at person8 city0)
   added: (in person8 plane1)
   changed: (onboard plane1) from 0 to 1
   goals met: 1 of 9
2. (board person2 plane2 city7)
   deleted: (at person2 city7)
   added: (in person2 plane2)
   changed: (onboard plane2) from 0 to 1
   goals met: 1 of 9
3. (refuel plane1 city0)
   changed: (fuel plane1) from 940 to 2874
   goals met: 1 of 9
4. (refuel plane2 city7)
   changed: (fuel plane2) from 1659 to 7274
   goals met: 1 of 9
5. (fly plane1 city0 city3)
   deleted: (at plane1 city0)
   added: (at plane1 city3)
   changed: (total-fuel-used) from 0 to 796, (fuel plane1) from 2874 to 2078
   goals met: 0 of 9
6. (debark person8 plane1 city3)
   deleted: (in person8 plane1)
   added: (at person8 city3)
   changed: (onboard plane1) from 1 to 0
   goals met: 1 of 9
7. (fly plane1 city3 city7)
   deleted: (at plane1 city3)
   added: (at plane1 city7)
   changed: (total-fuel-used) from 796 to 1322, (fuel plane1) from 2078 to 1552
   goals met: 1 of 9
8. (fly plane1 city7 city0)
   deleted: (at plane1 city7)
   added: (at plane1 city0)
   changed: (total-fuel-used) from 1322 to 2319, (fuel plane1) from 1552 to 555
   goals met: 2 of 9
9. (fly plane2 city7 city4)
   deleted: (at plane2 city7)
   added: (at plane2 city4)
   changed: (total-fuel-used) from 2319 to 3843, (fuel plane2) from 7274 to 5750
   goals met: 2 of 9
10. (debark person2 plane2 city4)
   deleted: (in person2 plane2)
   added: (at person2 city4)
   changed: (onboard plane2) from 1 to 0
   goals met: 3 of 9
11. (board person6 plane2 city4)
   deleted: (at person6 city4)
   added: (in person6 plane2)
   changed: (onboard plane2) from 0 to 1
   goals met: 3 of 9
12. (board person1 plane2 city4)
   deleted: (at person1 city4)
   added: (in person1 plane2)
   changed: (onboard plane2) from 1 to 2
   goals met: 3 of 9
13. (fly plane2 city4 city1)
   deleted: (at plane2 city4)
   added: (at plane2 city1)
   changed: (total-fuel-used) from 3843 to 5424, (fuel plane2) from 5750 to 4169
   goals met: 3 of 9
14. (board person7 plane2 city1)
   deleted: (at person7 city1)
   added: (in person7 plane2)
   changed: (onboard plane2) from 2 to 3
   goals met: 3 of 9
15. (board person3 plane2 city1)
   deleted: (at person3 city1)
   added: (in person3 plane2)
   changed: (onboard plane2) from 3 to 4
   goals met: 3 of 9
16. (board person4 plane2 city1)
   deleted: (at person4 city1)
   added: (in person4 plane2)
   changed: (onboard plane2) from 4 to 5
   goals met: 3 of 9
17. (fly plane2 city1 city6)
   deleted: (at plane2 city1)
   added: (at plane2 city6)
   changed: (total-fuel-used) from 5424 to 7056, (fuel plane2) from 4169 to 2537
   goals met: 3 of 9
18. (refuel plane2 city6)
   changed: (fuel plane2) from 2537 to 7274
   goals met: 3 of 9
19. (board person5 plane2 city6)
   deleted: (at person5 city6)
   added: (in person5 plane2)
   changed: (onboard plane2) from 5 to 6
   goals met: 3 of 9
20. (fly plane2 city6 city7)
   deleted: (at plane2 city6)
   added: (at plane2 city7)
   changed: (total-fuel-used) from 7056 to 9693, (fuel plane2) from 7274 to 4637
   goals met: 3 of 9
21. (debark person6 plane2 city7)
   deleted: (in person6 plane2)
   added: (at person6 city7)
   changed: (onboard plane2) from 6 to 5
   goals met: 4 of 9
22. (debark person7 plane2 city7)
   deleted: (in person7 plane2)
   added: (at person7 city7)
   changed: (onboard plane2) from 5 to 4
   goals met: 5 of 9
23. (debark person3 plane2 city7)
   deleted: (in person3 plane2)
   added: (at person3 city7)
   changed: (onboard plane2) from 4 to 3
   goals met: 6 of 9
24. (debark person5 plane2 city7)
   deleted: (in person5 plane2)
   added: (at person5 city7)
   changed: (onboard plane2) from 3 to 2
   goals met: 7 of 9
25. (fly plane2 city7 city0)
   deleted: (at plane2 city7)
   added: (at plane2 city0)
   changed: (total-fuel-used) from 9693 to 12684, (fuel plane2) from 4637 to 1646
   goals met: 7 of 9
26. (debark person1 plane2 city0)
   deleted: (in person1 plane2)
   added: (at person1 city0)
   changed: (onboard plane2) from 2 to 1
   goals met: 8 of 9
27. (debark person4 plane2 city0)
   deleted: (in person4 plane2)
   added: (at person4 city0)
   changed: (onboard plane2) from 1 to 0
   goals met: 9 of 9
